In [1]:
import numpy as np
from numpy import nan as NA
import pandas as pd

In [2]:
# adding null values to a Series
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) 
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None 
string_data[1] = np.nan
string_data.isnull()

0     True
1     True
2     True
3    False
dtype: bool

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7]) 
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]]) 
cleaned = data.dropna() 
cleaned

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [8]:
data.dropna(how='all') # drop rows with all NA values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna(how='all', axis=1) # drop columns with all NA values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7, 3)) 
df.iloc[:4, 1] = NA 
df.iloc[:2, 2] = NA 
df

          0         1         2
0  0.379166       NaN       NaN
1 -1.003733       NaN       NaN
2  0.600920       NaN  1.174022
3  0.902286       NaN  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [11]:
df.dropna()# drop rows with any NA values

          0         1         2
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [12]:
df.dropna(thresh=2) # drop rows with at least 2 non-NA values

          0         1         2
2  0.600920       NaN  1.174022
3  0.902286       NaN  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [13]:
df.fillna(0) # fill NA values with 0

          0         1         2
0  0.379166  0.000000  0.000000
1 -1.003733  0.000000  0.000000
2  0.600920  0.000000  1.174022
3  0.902286  0.000000  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [14]:
df.fillna({1: 0.5, 2: 0}) # fill NA values with 0 in column 1 and 0 in column 2

          0         1         2
0  0.379166  0.500000  0.000000
1 -1.003733  0.500000  0.000000
2  0.600920  0.500000  1.174022
3  0.902286  0.500000  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [ ]:
_ = df.fillna(0, inplace=False) 
df # fill NA values with 0 in place

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [16]:
df.fillna(method='bfill') # forward fill NA values

C:\Users\dhruv\AppData\Local\Temp\ipykernel_4408\4237787228.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill') # forward fill NA values

          0         1         2
0  0.379166 -0.562769  1.174022
1 -1.003733 -0.562769  1.174022
2  0.600920 -0.562769  1.174022
3  0.902286 -0.562769  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [17]:
df.fillna(method='bfill', limit=2)

C:\Users\dhruv\AppData\Local\Temp\ipykernel_4408\1794586188.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill', limit=2)

          0         1         2
0  0.379166       NaN  1.174022
1 -1.003733       NaN  1.174022
2  0.600920 -0.562769  1.174022
3  0.902286 -0.562769  1.542265
4  0.304902 -0.562769 -0.089308
5 -0.060920  0.430327 -2.219135
6  0.363110  0.594475  0.525432

In [18]:
data = pd.Series([1., NA, 3.5, NA, 7]) 
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [19]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]}) 
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated() #check for duplicates in the DataFrame

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 
'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}) 
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = { 
'bacon': 'pig', 
'pulled pork': 'pig', 
'pastrami': 'cow', 
'corned beef': 'cow', 
'honey ham': 'pig', 
'nova lox': 'salmon' 
} 

lowercased = data['food'].str.lower() 
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [24]:
data = pd.Series([1., -999., 2., -999., -1000., 3.]) 
data.drop_duplicates() # check for duplicates in the Series

0       1.0
1    -999.0
2       2.0
4   -1000.0
5       3.0
dtype: float64

In [25]:
data.replace(-999, np.nan) # replace -999 with NA values

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [26]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4))) 
sampler = np.random.permutation(5) 
sampler 

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [27]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

# Apply transformation to index
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [28]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [29]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats # cut ages into bins

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [30]:
data = pd.DataFrame(np.random.randn(1000, 4))
outliers = data[2][np.abs(data[2]) > 3]